&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СформироватьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыручкаОбороты.Модель КАК Точка,
		|	ВыручкаОбороты.СуммаОборот КАК Значение
		|ИЗ
		|	РегистрНакопления.Выручка.Обороты(, , , ) КАК ВыручкаОбороты
		|УПОРЯДОЧИТЬ ПО
		|	Значение УБЫВ";

	Выборка = Запрос.Выполнить().Выбрать();

	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	Серия = Диаграмма.УстановитьСерию("Выручка");

	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Строка(Выборка.Точка));
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.Значение);
	КонецЦикла;

КонецПроцедуры
