&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СформироватьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПосещениеЭкскурсии.Экскурсия КАК Точка,
		|	СУММА(ПосещениеЭкскурсии.Сумма) КАК Значение
		|ИЗ
		|	Документ.ПосещениеЭкскурсии КАК ПосещениеЭкскурсии
		|ГДЕ
		|	ПосещениеЭкскурсии.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ПосещениеЭкскурсии.Экскурсия
		|УПОРЯДОЧИТЬ ПО
		|	Значение УБЫВ";

	Выборка = Запрос.Выполнить().Выбрать();

	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	Серия = Диаграмма.УстановитьСерию("Доход");

	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Строка(Выборка.Точка));
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.Значение);
	КонецЦикла;

КонецПроцедуры
