&НаКлиенте
Процедура ПересчитатьИтог()
	Итого = 0;
	Для Каждого Строка Из Объект.СписокТоваров Цикл
		Итого = Итого + Строка.Количество;
	КонецЦикла;
	ИтогоКоличество = Итого;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Итого = 0;
	Для Каждого Строка Из Объект.СписокТоваров Цикл
		Итого = Итого + Строка.Количество;
	КонецЦикла;
	ИтогоКоличество = Итого;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ПересчитатьИтог();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПослеУдаления(Элемент)
	ПересчитатьИтог();
КонецПроцедуры
